package com.logictech.dwzq.core.constants;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by wangchao on 15/10/14.
 */
public enum ChannelConstants {
    /**
     * TIP: code＝渠道号＋平台类型＋顺序
     */
    // 应用宝新增注册用户数(安卓)
    ANDROID_CHANNEL_10011("10011", "应用宝新增注册用户数(安卓)"),
    // 应用宝新增非注册用户数(安卓)
    ANDROID_CHANNEL_10012("10012", "应用宝新增非注册用户数(安卓)"),
    // 应用宝新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_10013("10013", "应用宝新增绑定证券用户数(安卓)"),
    // 应用宝注册用户总数(安卓)
    ANDROID_CHANNEL_10014("10014", "应用宝注册用户总数(安卓)"),
    // 应用宝非注册用户总数(安卓)
    ANDROID_CHANNEL_10015("10015", "应用宝非注册用户总数(安卓)"),
    // 360移动助手新增注册用户数(安卓)
    ANDROID_CHANNEL_10111("10111", "360移动助手新增注册用户数(安卓)"),
    // 360移动助手新增非注册用户数(安卓)
    ANDROID_CHANNEL_10112("10112", "360移动助手新增非注册用户数(安卓)"),
    // 360移动助手新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_10113("10113", "360移动助手新增绑定证券用户数(安卓)"),
    // 360移动助手注册用户总数(安卓)
    ANDROID_CHANNEL_10114("10114", "360移动助手注册用户总数(安卓)"),
    // 360移动助手非注册用户总数(安卓)
    ANDROID_CHANNEL_10115("10115", "360移动助手非注册用户总数(安卓)"),
    // 小米市场新增注册用户数(安卓)
    ANDROID_CHANNEL_10211("10211", "小米市场新增注册用户数(安卓)"),
    // 小米市场新增非注册用户数(安卓)
    ANDROID_CHANNEL_10212("10212", "小米市场新增非注册用户数(安卓)"),
    // 小米市场新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_10213("10213", "小米市场新增绑定证券用户数(安卓)"),
    // 小米市场注册用户总数(安卓)
    ANDROID_CHANNEL_10214("10214", "小米市场注册用户总数(安卓)"),
    // 小米市场非注册用户总数(安卓)
    ANDROID_CHANNEL_10215("10215", "小米市场非注册用户总数(安卓)"),
    // 豌豆荚新增注册用户数(安卓)
    ANDROID_CHANNEL_10311("10311", "豌豆荚新增注册用户数(安卓)"),
    // 豌豆荚新增非注册用户数(安卓)
    ANDROID_CHANNEL_10312("10312", "豌豆荚新增非注册用户数(安卓)"),
    // 豌豆荚新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_10313("10313", "豌豆荚新增绑定证券用户数(安卓)"),
    // 豌豆荚注册用户总数(安卓)
    ANDROID_CHANNEL_10314("10314", "豌豆荚注册用户总数(安卓)"),
    // 豌豆荚非注册用户总数(安卓)
    ANDROID_CHANNEL_10315("10315", "豌豆荚非注册用户总数(安卓)"),
    // 百度助手新增注册用户数(安卓)
    ANDROID_CHANNEL_10511("10511", "百度助手新增注册用户数(安卓)"),
    // 百度助手新增非注册用户数(安卓)
    ANDROID_CHANNEL_10512("10512", "百度助手新增非注册用户数(安卓)"),
    // 百度助手新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_10513("10513", "百度助手新增绑定证券用户数(安卓)"),
    // 百度助手注册用户总数(安卓)
    ANDROID_CHANNEL_10514("10514", "百度助手注册用户总数(安卓)"),
    // 百度助手非注册用户总数(安卓)
    ANDROID_CHANNEL_10515("10515", "百度助手非注册用户总数(安卓)"),
    // 其他线上推广版新增注册用户数(安卓)
    ANDROID_CHANNEL_10611("10611", "其他线上推广版新增注册用户数(安卓)"),
    // 其他线上推广版新增非注册用户数(安卓)
    ANDROID_CHANNEL_10612("10612", "其他线上推广版新增非注册用户数(安卓)"),
    // 其他线上推广版新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_10613("10613", "其他线上推广版新增绑定证券用户数(安卓)"),
    // 其他线上推广版注册用户总数(安卓)
    ANDROID_CHANNEL_10614("10614", "其他线上推广版注册用户总数(安卓)"),
    // 其他线上推广版非注册用户总数(安卓)
    ANDROID_CHANNEL_10615("10615", "其他线上推广版非注册用户总数(安卓)"),
    // 建设银行版新增注册用户数(安卓)
    ANDROID_CHANNEL_10711("10711", "建设银行版新增注册用户数(安卓)"),
    // 建设银行版新增非注册用户数(安卓)
    ANDROID_CHANNEL_10712("10712", "建设银行版新增非注册用户数(安卓)"),
    // 建设银行版新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_10713("10713", "建设银行版新增绑定证券用户数(安卓)"),
    // 建设银行版注册用户总数(安卓)
    ANDROID_CHANNEL_10714("10714", "建设银行版注册用户总数(安卓)"),
    // 建设银行版非注册用户总数(安卓)
    ANDROID_CHANNEL_10715("10715", "建设银行版非注册用户总数(安卓)"),
    // 官网新增注册用户数(安卓)
    ANDROID_CHANNEL_10811("10811", "官网新增注册用户数(安卓)"),
    // 官网新增非注册用户数(安卓)
    ANDROID_CHANNEL_10812("10812", "官网新增非注册用户数(安卓)"),
    // 官网新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_10813("10813", "官网新增绑定证券用户数(安卓)"),
    // 官网注册用户总数(安卓)
    ANDROID_CHANNEL_10814("10814", "官网注册用户总数(安卓)"),
    // 官网非注册用户总数(安卓)
    ANDROID_CHANNEL_10815("10815", "官网非注册用户总数(安卓)"),
    // 华为市场新增注册用户数(安卓)
    ANDROID_CHANNEL_11111("11111", "华为市场新增注册用户数(安卓)"),
    // 华为市场新增非注册用户数(安卓)
    ANDROID_CHANNEL_11112("11112", "华为市场新增非注册用户数(安卓)"),
    // 华为市场新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_11113("11113", "华为市场新增绑定证券用户数(安卓)"),
    // 华为市场注册用户总数(安卓)
    ANDROID_CHANNEL_11114("11114", "华为市场注册用户总数(安卓)"),
    // 华为市场非注册用户总数(安卓)
    ANDROID_CHANNEL_11115("11115", "华为市场非注册用户总数(安卓)"),
    // 工商银行新增注册用户数(安卓)
    ANDROID_CHANNEL_11011("11011", "工商银行新增注册用户数(安卓)"),
    // 工商银行新增非注册用户数(安卓)
    ANDROID_CHANNEL_11012("11012", "工商银行新增非注册用户数(安卓)"),
    // 工商银行新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_11013("11013", "工商银行新增绑定证券用户数(安卓)"),
    // 工商银行注册用户总数(安卓)
    ANDROID_CHANNEL_11014("11014", "工商银行注册用户总数(安卓)"),
    // 工商银行非注册用户总数(安卓)
    ANDROID_CHANNEL_11015("11015", "工商银行非注册用户总数(安卓)"),
    // 联想新增注册用户数(安卓)
    ANDROID_CHANNEL_11211("11211", "联想新增注册用户数(安卓)"),
    // 联想新增非注册用户数(安卓)
    ANDROID_CHANNEL_11212("11212", "联想新增非注册用户数(安卓)"),
    // 联想新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_11213("11213", "联想新增绑定证券用户数(安卓)"),
    // 联想新增注册用户总数(安卓)
    ANDROID_CHANNEL_11214("11214", "联想新增注册用户总数(安卓)"),
    // 联想新增非注册用户总数(安卓)
    ANDROID_CHANNEL_11215("11215", "联想新增非注册用户总数(安卓)"),
    // 魅族新增注册用户数(安卓)
    ANDROID_CHANNEL_11311("11311", "魅族新增注册用户数(安卓)"),
    // 魅族新增非注册用户数(安卓)
    ANDROID_CHANNEL_11312("11312", "魅族新增非注册用户数(安卓)"),
    // 魅族新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_11313("11313", "魅族新增绑定证券用户数(安卓)"),
    // 魅族注册用户总数(安卓)
    ANDROID_CHANNEL_11314("11314", "魅族注册用户总数(安卓)"),
    // 魅族非注册用户总数(安卓)
    ANDROID_CHANNEL_11315("11315", "魅族非注册用户总数(安卓)"),
    // 三星新增注册用户数(安卓)
    ANDROID_CHANNEL_11411("11411", "三星新增注册用户数(安卓)"),
    // 三星新增非注册用户数(安卓)
    ANDROID_CHANNEL_11412("11412", "三星新增非注册用户数(安卓)"),
    // 三星新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_11413("11413", "三星新增绑定证券用户数(安卓)"),
    // 三星注册用户总数(安卓)
    ANDROID_CHANNEL_11414("11414", "三星注册用户总数(安卓)"),
    // 三星非注册用户总数(安卓)
    ANDROID_CHANNEL_11415("11415", "三星非注册用户总数(安卓)"),
    // 其他应用市场新增注册用户数(安卓)
    ANDROID_CHANNEL_11511("11511", "其他应用市场新增注册用户数(安卓)"),
    // 其他应用市场新增非注册用户数(安卓)
    ANDROID_CHANNEL_11512("11512", "其他应用市场新增非注册用户数(安卓)"),
    // 其他应用市场新增绑定证券用户数(安卓)
    ANDROID_CHANNEL_11513("11513", "其他应用市场新增绑定证券用户数(安卓)"),
    // 其他应用市场注册用户总数(安卓)
    ANDROID_CHANNEL_11514("11514", "其他应用市场注册用户总数(安卓)"),
    // 其他应用市场非注册用户总数(安卓)
    ANDROID_CHANNEL_11515("11515", "其他应用市场非注册用户总数(安卓)"),

    // Appstore新增注册用户数(IOS)
    IOS_CHANNEL_10921("10921", "Appstore新增注册用户数(IOS)"),
    // Appstore新增非注册用户数(IOS)
    IOS_CHANNEL_10922("10922", "Appstore新增非注册用户数(IOS)"),
    // Appstore新增绑定证券用户数(IOS)
    IOS_CHANNEL_10923("10923", "Appstore新增绑定证券用户数(IOS)"),
    // Appstore注册用户总数(IOS)
    IOS_CHANNEL_10924("10924", "Appstore注册用户总数(IOS)"),
    // Appstore非注册用户总数(IOS)
    IOS_CHANNEL_10925("10925", "Appstore非注册用户总数(IOS)"),
    // 官网新增注册用户数(IOS)
    IOS_CHANNEL_10821("10821", "官网新增注册用户数(IOS)"),
    // 官网新增非注册用户数(IOS)
    IOS_CHANNEL_10822("10822", "官网新增非注册用户数(IOS)"),
    // 官网新增绑定证券用户数(IOS)
    IOS_CHANNEL_10823("10823", "官网新增绑定证券用户数(IOS)"),
    // 官网注册用户总数(IOS)
    IOS_CHANNEL_10824("10824", "官网注册用户总数(IOS)"),
    // 官网非注册用户总数(IOS)
    IOS_CHANNEL_10825("10825", "官网非注册用户总数(IOS)"),
    // 建设银行版新增注册用户数(IOS)
    IOS_CHANNEL_10721("10721", "建设银行版新增注册用户数(IOS)"),
    // 建设银行版新增非注册用户数(IOS)
    IOS_CHANNEL_10722("10722", "建设银行版新增非注册用户数(IOS)"),
    // 建设银行版新增绑定证券用户数(IOS)
    IOS_CHANNEL_10723("10723", "建设银行版新增绑定证券用户数(IOS)"),
    // 建设银行版注册用户总数(IOS)
    IOS_CHANNEL_10724("10724", "建设银行版注册用户总数(IOS)"),
    // 建设银行版非注册用户总数(IOS)
    IOS_CHANNEL_10725("10725", "建设银行版非注册用户总数(IOS)"),
    // 工商银行版新增注册用户数(IOS)
    IOS_CHANNEL_11021("11021", "工商银行版新增注册用户数(IOS)"),
    // 工商银行版新增非注册用户数(IOS)
    IOS_CHANNEL_11022("11022", "工商银行版新增非注册用户数(IOS)"),
    // 工商银行版新增绑定证券用户数(IOS)
    IOS_CHANNEL_11023("11023", "工商银行版新增绑定证券用户数(IOS)"),
    // 工商银行版注册用户总数(IOS)
    IOS_CHANNEL_11024("11024", "工商银行版注册用户总数(IOS)"),
    // 工商银行版非注册用户总数(IOS)
    IOS_CHANNEL_11025("11025", "工商银行版非注册用户总数(IOS)"),
    // 其他线上推广版新增注册用户数(IOS)
    IOS_CHANNEL_10621("10621", "其他线上推广版新增注册用户数(IOS)"),
    // 其他线上推广版新增非注册用户数(IOS)
    IOS_CHANNEL_10622("10622", "其他线上推广版新增非注册用户数(IOS)"),
    // 其他线上推广版新增绑定证券用户数(IOS)
    IOS_CHANNEL_10623("10623", "其他线上推广版新增绑定证券用户数(IOS)"),
    // 其他线上推广版注册用户总数(IOS)
    IOS_CHANNEL_10624("10624", "其他线上推广版注册用户总数(IOS)"),
    // 其他线上推广版非注册用户总数(IOS)
    IOS_CHANNEL_10625("10625", "其他线上推广版非注册用户总数(IOS)");

    private String code;
    private String name;

    private ChannelConstants(String code, String name) {
        this.code = code;
        this.name = name;
    }

    public String getCode() {
        return code;
    }

    public String getName() {
        return name;
    }

    public static Map<String, String> getEnumToMap() {
        Map<String, String> retMap = new HashMap<String, String>();
        for (ChannelConstants s : ChannelConstants.values()) {
            retMap.put(s.getCode(), s.getName());
        }
        return retMap;
    }
}
